import { FeatureContent } from "../../components/Features";
import { Testimonial } from "../../components/Testimonials";

export const heroInfo = {
  title: "Развивайте гибкие навыки",
  subtitle:
    "Улучшайте результаты во всех сферах жизни с помощью регулярной практики гибких навыков в онлайн-формате. Курсы, статьи и онлайн-тренажеры по научно-доказанным методологиям",
  btn1Text: "Начать",
  btn2Text: "Подробности",
  imgSrc:
    "https://images.unsplash.com/photo-1499209974431-9dddcece7f88?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
};

export const featureContent: FeatureContent = {
  title: "Возможности платформы SoftSkillz",
  subtitle:
    "Гибкие навыки - один из ключевых факторов продвижения по карьере, залог хороших отношений с друзьями и в семье",
  features: [
    {
      title: "Регулярная практика",
      body: "Существует множество замечательных книг по любой теме - от переговоров до популярной психологии. Проблема в том, что чтение книг не помогает. Чтобы сформировать навыки, требуются тренировки. Мы помогаем любому человеку тренироваться каждый день и чувствовать прогресс",
    },
    {
      title: "Надежные инструменты",
      body: "В интернете огромное количество непроверенной информации, которая может навредить. Мы тщательно подходим к подготовке маетриалов и онлайн тренажеров и используем только научно-доказанные подходы",
    },
    {
      title: "Бесплатно",
      body: "Тренинги по гибким навыком стоят от нескольких десятков до нескольких сотен тысяч рублей за три месяца. Наша миссия - помочь всем желающим развиваться независимо от финансового положения",
    },
  ],
};

export const testimonialsContent: Testimonial[] = [
  {
    emphasized:
      "После практики на платформе у меня заметно улучшилось взаимодействие с командой. А спустя полгода я получил повышение в должности и зп",
    body: "Раньше я не уделял внимания осознанному развитию своих навыков общения с коллегами. Мне казалось, что любой человек умеет общаться и это не требует каких-то специальных знаний. Но меня беспокоили регулярные конфликты и недопонимания. Я случайно узнал про платформу SoftSkillz, начал читать материалы и делать упражнения. Я узнал много нового и почувствовал прогресс с первого дня",
    color: "purple",
    author: {
      avatar:
        "https://images.unsplash.com/photo-1570295999919-56ceb5ecca61?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mnx8YXZhdGFyfGVufDB8MnwwfHw%3D&auto=format&fit=crop&w=500&q=60",
      name: "Лев Кузнецов",
      position: "Продуктовый дизайнер",
    },
  },
  {
    emphasized: "Заняти легко встроились в мой график",
    body: "Раньше мне было сложно найти время, чтобы ездить на какие-то тренинги. А онлайн-тренажер можно использовать где и когда угодно - пока я еду в метро, стою в очереди или принимаю пищу",
    color: "green",
    author: {
      avatar:
        "https://images.unsplash.com/photo-1535713875002-d1d0cf377fde?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8YXZhdGFyfGVufDB8MnwwfHw%3D&auto=format&fit=crop&w=500&q=60",
      name: "Владислав Петровский",
      position: "Хирург",
    },
  },
  {
    emphasized: "В целом замечательный и полезный опыт",
    body: "Спасибо за прекрасный опыт! Теперь у меня есть работа, которая мне действительно нравится, и я хорошо зарабатываю, занимаясь любимым делом.",
    color: "",
    author: {
      avatar:
        "https://images.unsplash.com/photo-1527980965255-d3b416303d12?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8M3x8YXZhdGFyfGVufDB8MnwwfHw%3D&auto=format&fit=crop&w=500&q=60",
      name: "Фёдор Петров",
      position: "Специалист по связям с общественностью",
    },
  },
  {
    emphasized: "Качественные материалы и упражнения",
    body: "Нравится, как написаны статьи - без воды и с наглядными примерами. Когда я что-то читаю, то постоянно ловлю какие-то инсайты. А после практики на платформе я легко могу использовать новые навыки в жизни. Но, самое главное, я вижу реальные результаты!",
    color: "blue",
    author: {
      avatar:
        "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NHx8YXZhdGFyfGVufDB8MnwwfHw%3D&auto=format&fit=crop&w=500&q=60",
      name: "Марк Терентьев",
      position: "Тестировщик",
    },
  },
  {
    emphasized: "Такой жизненно-важный опыт. Горячо рекомендую!",
    body: "Раньше я читал много книг по психологии, переговорам и продажам. Мне хотелось развиваться. Но в какой-то момент я понял, что информация из книг быстро забывается, а в жизни ничего не меняется. Как будто не хватало какого-то элемента. Благодаря сервису SoftSkillz я осознал, что таким элементом была практическая отработка полученных знаний. Я начал с ежедневного заполнения КПТ формы, чтобы лучше понимать свои эмоции и менять образ мышления. Спустя месяц я чувствую, что стал мыслить намного более рационально, испытывать меньше отрицательных эмоций и переживать их менее болезненно",
    color: "",
    author: {
      avatar:
        "https://images.unsplash.com/photo-1628157588553-5eeea00af15c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NXx8YXZhdGFyfGVufDB8MnwwfHw%3D&auto=format&fit=crop&w=500&q=60",
      name: "Али Зайцев",
      position: "Менеджер проектов",
    },
  },
];
